#### GetEnumerator Method

---

|  |
| --- |
| FluidType Class   See Also |

Returns an enumerator that iterates through a collection.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator<FluidTemperature> GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator(Of FluidTemperature) ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator<FluidTemperature^>^ GetEnumerator() ``` |

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

 IEnumerable T GetEnumerator

# See Also

FluidType Class

Autodesk.Revit.DB.Plumbing Namespace